# Books (Core)
Martisha Owens

11/13/2022

## Part 1: Design an ERD

![png](Books_ERD.png)

## Part 2: Create the database in Python

In [1]:
import pandas as pd
import numpy as np

In [2]:
import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

connection = "mysql+pymysql://root:coding3033@localhost/books"

In [3]:
engine = create_engine(connection)

In [5]:
create_database(connection)

In [7]:
df = pd.read_csv('users.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [8]:
df.to_sql('users', engine, if_exists = 'replace')

3

In [9]:
dff = pd.read_csv('favorites.csv')
dff.to_sql('favorites', engine, if_exists = 'replace')
dff.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [10]:
dfb = pd.read_csv('books.csv')
dfb.to_sql('books', engine, if_exists = 'replace')
dfb.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [11]:
dfa = pd.read_csv('authors.csv')
dfa.to_sql('authors', engine, if_exists = 'replace')
dfa.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [12]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [22]:
##list the titles of all of John Doe's favorite books. 

q = """
SELECT b.title
FROM books b
JOIN favorites f ON b.id = f.book_id
WHERE f.user_id = 
    (SELECT id FROM users WHERE last_name = "Doe" AND first_name = "John")
;
"""
pd.read_sql(q, engine)

              title
0       The Shining
1                It
2  The Great Gatsby